/* See COPYING file for copyright and license details. */
#include <unistd.h>
#include <errno.h>
#include <regex.h>
#include <ctype.h>
#include <assert.h>
#include <math.h>
#include <X11/cursorfont.h>
#include <X11/keysym.h>
#include <X11/XKBlib.h>
#include <X11/Xatom.h>
#include <X11/Xlib.h>
#include <X11/Xproto.h>
#include <X11/Xutil.h>
#include <X11/Xresource.h>
#include <X11/Xft/Xft.h>
#include "adwm.h"
#include "resource.h"
#include "actions.h"
#include "parse.h"

/*
 * The purpose of this file is to provide a loadable module that provides
 * functions to mimic the behaviour and style of fluxbox.  This module reads the
 * fluxbox configuration file to determine configuration information and
 * accesses a fluxbox(1) style file.  It also reads the fluxbox(1) keys
 * configuration file to find key and mouse bindings.
 *
 * Note that fluxbox(1) does not permit its style to change anything regarding
 * key bindings or configuration settings: just styles.
 *
 * This module is really just intended to access a large volume of fluxbox
 * styles.  Fluxbox style files are similar to blackbox(1), openbox(1) and
 * waimea(1).
 */

typedef struct {
	Bool topleft;
	Bool topright;
	Bool botleft;
	Bool botright;
} FluxboxCorners;

typedef enum {
	EffectNone,
	EffectShadow,
	EffectHalo
} FluxboxEffect;

typedef struct {
	struct {
		struct {
			Texture focus, unfocus, pressed;
		} button;
		struct {
			AdwmPixmap pixmap;
			struct {
				AdwmPixmap pixmap;
			} pressed, unfocus;
		} close, iconify, maximize, shade, stick;
		struct {
			AdwmPixmap pixmap;
			struct {
				AdwmPixmap pixmap;
			} unfocus;
		} stuck, lhalf, rhalf;
		struct {
			Texture focus, unfocus;
		} grip, handle;
		struct {
			Texture focus, unfocus, active;
		} label;
		struct {
			Texture focus, unfocus;
			unsigned height;
		} title;
		struct {
			XColor focusColor;
			XColor unfocusColor;
		} frame;

		unsigned bevelWidth;
		Bool shaded;
		unsigned borderWidth;
		XColor borderColor;
		FluxboxCorners roundCorners;
		Justify justify;
		unsigned handleWidth;
		struct {
			AdwmFont font;
			FluxboxEffect effect;
			struct {
				XftColor color;
				unsigned x;
				unsigned y;
			} shadow;
			struct {
				XftColor color;
			} halo;
		};
	} window;
	/* fallbacks: obsolete */
	XColor borderColor;
	unsigned borderWidth;
	unsigned bevelWidth;
	unsigned frameWidth;
	unsigned handleWidth;
} FluxboxStyle;

typedef enum {
	PlaceBottomLeft,
	PlaceBottomCenter,
	PlaceBottomRight,
	PlaceLeftBottom,
	PlaceLeftCenter,
	PlaceLeftTop,
	PlaceRightBottom,
	PlaceRightCenter,
	PlaceRightTop,
	PlaceTopLeft,
	PlaceTopCenter,
	PlaceTopRight,
} FluxboxPlace;

typedef enum {
	AlignLeft,
	AlignRelative,
	AlignRight,
} FluxboxAlign;

typedef enum {
	PlacementRowSmart,
	PlacementColSmart,
	PlacementCascade,
	PlacementUnderMouse,
} FluxboxPlacement;

typedef enum {
	PlaceLeftToRight,
	PlaceRightToLeft,
	PlaceTopToBottom = PlaceLeftToRight,
	PlaceBottomToTop = PlaceRightToLeft,
} FluxboxPlaceDir;

typedef enum {
	AttachAreaWindow,
	AttachAreaTitlebar,
} FluxboxAttachArea;

typedef enum {
	DirectionHorizontal,
	DirectionVertical,
} FluxboxDirection;

typedef enum {
	FocusModelClickToFocus,
	FocusModelMouseFocus,
	FocusModelStrictMouseFocus,
} FluxboxFocusModel;

typedef enum {
	LayerAboveDock,
	LayerDock,
	LayerTop,
	LayerNormal,
	LayerBottom,
	LayerDesktop,
} FluxboxLayer;

typedef enum {
	DecoNormal,
	DecoNone,
	DecoBorder,
	DecoTab,
	DecoTiny,
	DecoTool,
} FluxboxDeco;

typedef struct {
	struct {
		struct {
			unsigned alpha;	/* 255 */
		} focus, unfocus;
	} window;
	struct {
		unsigned alpha;		/* 255 *//* undocumented */
	} menu;
	struct {
		Bool autoHide;		/* False */
		FluxboxLayer layer;	/* Dock */
		FluxboxPlace placement;	/* RightBottom */
		Bool maxOver;		/* False */
		unsigned onhead;	/* 0 */
		Bool acceptKdeDockapps;	/* undocumented */
		unsigned alpha;		/* 255 *//* undocumented */
		FluxboxDirection direction;	/* undocumented */
		Bool onTop;		/* undocumented */
	} slit;
	struct {
		unsigned alpha;		/* 255 */
		Bool autoHide;		/* False */
		FluxboxLayer layer;	/* Dock */
		FluxboxPlace placement;	/* BottomCenter */
		Bool maxOver;		/* False */
		unsigned height;	/* 0 */
		Bool visible;		/* True */
		unsigned widthPercent;	/* 100 */
		const char *tools;	/* workspacename, prevworkspace, nextworkspace,
					   iconbar, prevwindow, nextwindow, systemtray,
					   clock */
		unsigned onhead;	/* 1 */
		Bool onTop;
	} toolbar;
	struct {
		Bool maxOver;		/* False */
		Bool intitlebar;	/* True */
		Bool usePixmap;
	} tabs;
	struct {
		const char *pattern;
		const char *mode;	/* {static groups} (workspace) */
		Bool usePixmap;		/* True */
		unsigned iconTextPadding;	/* 10 */
		FluxboxAlign alignment;	/* Relative */
		unsigned iconWidth;	/* 128 */
		const char *wheelMode;	/* Screen *//* undocumented */
	} iconbar;
	struct {
		const char *capStyle;	/* undocumented */
		const char *joinStyle;	/* undocumented */
		const char *lineStyle;	/* undocumented */
		const char *lineWidth;	/* undocumented */
	} overlay;
	struct {
		FluxboxPlace placement;	/* TopLeft */
		unsigned width;		/* 64 */
		unsigned height;
	} tab;
	struct {
		const char *left;	/* mis-documented as session resource */
		const char *right;	/* mis-documented as session resource */
	} titlebar;
	const char *strftimeFormat;	/* %k:%M */
	Bool autoRaise;			/* True */
	Bool clickRaises;		/* True */
	Bool workspacewarping;		/* True */
	Bool showwindowposition;	/* False */
	FluxboxDeco defaultDeco;	/* NORMAL */
	unsigned menuDelay;		/* 200 */
	unsigned menuDelayClose;	/* undocumented */
	const char *menuMode;		/* undocumented */
	Bool focusNewWindows;		/* True */
	const char *workspaceNames;	/* Workspace 1, Workspace 2, Workspace 3,
					   Workspace 4 */
	unsigned edgeSnapThreshold;	/* 10 */
	FluxboxPlacement windowPlacement;	/* RowSmartPlacement */
	FluxboxPlaceDir rowPlacementDirection;	/* LeftToRight */
	FluxboxPlaceDir colPlacementDirection;	/* TopToBottom */
	Bool fullMaximization;		/* False */
	Bool opaqueMove;		/* True */
	unsigned workspaces;		/* 4 */
	const char *windowMenu;		/* ~/.fluxbox/windowmenu */
	/* not documented */
	Bool allowRemoteActions;	/* False */
	struct {
		Bool usePixmap;		/* True *//* undocumented */
	} clientMenu;
	Bool decorateTransient;		/* True */
	unsigned demandsAttentionTimeout;	/* 500 */
	Bool desktopwheeling;		/* True */
	Bool focusLastWindow;		/* True */
	FluxboxFocusModel focusModel;	/* ClickToFocus */
	Bool focusSameHead;		/* False */
	const char *followModel;
	Bool imageDither;		/* True *//* undocumented */
	Bool maxDisableMove;		/* False *//* undocumented */
	Bool maxDisableResize;		/* False *//* undocumented */
	Bool maxIgnoreIncrement;	/* False *//* undocumented */
	unsigned noFocusWhileTypingDelay;	/* 0 *//* undocumented */
	const char *resizeMode;		/* Bottom *//* undocumented */
	Bool reversewheeling;		/* False *//* undocumented */
	const char *rootCommand;	/* "" *//* undocumented */
	const char *tabFocusModel;	/* SloppyTabFocus *//* undocumented */
	unsigned tooltipDelay;		/* 500 *//* undocumented */
	const char *userFollowModel;	/* Follow *//* undocumented */
	const char *windowScrollAction;	/* "" *//* undocumented */
	Bool windowScrollReverse;	/* False *//* undocumented */
} FluxboxScreen;

/*

session.screen0.allowRemoteActions:	true
session.screen0.autoRaise:	false
session.screen0.clickRaises:	true
session.screen0.clientMenu.usePixmap:	true
session.screen0.colPlacementDirection:	TopToBottom
session.screen0.decorateTransient:	true
session.screen0.defaultDeco:	NORMAL
session.screen0.demandsAttentionTimeout:	500
session.screen0.desktopwheeling:	true
session.screen0.edgeSnapThreshold:	0
session.screen0.focusLastWindow:	True
session.screen0.focusModel:	StrictMouseFocus
session.screen0.focusNewWindows:	true
session.screen0.focusSameHead:	false
session.screen0.followModel:	Ignore
session.screen0.fullMaximization:	false
session.screen0.iconbar.alignment:	Relative
session.screen0.iconbar.iconTextPadding:	10
session.screen0.iconbar.iconWidth:	70
session.screen0.iconbar.mode:	{static groups}
session.screen0.iconbar.usePixmap:	true
session.screen0.iconbar.wheelMode:	Screen
session.screen0.imageDither:	true
session.screen0.maxDisableMove:	false
session.screen0.maxDisableResize:	false
session.screen0.maxIgnoreIncrement:	false
session.screen0.menu.alpha:	224
session.screen0.menuDelay:	0
session.screen0.menuDelayClose:	0
session.screen0.menuMode:	Delay
session.screen0.noFocusWhileTypingDelay:	0
session.screen0.opaqueMove:	true
session.screen0.overlay.capStyle:	CapNotLast
session.screen0.overlay.joinStyle:	JoinMiter
session.screen0.overlay.lineStyle:	LineSolid
session.screen0.overlay.lineWidth:	1
session.screen0.resizeMode:	Bottom
session.screen0.reversewheeling:	false
session.screen0.rootCommand:	xprop -root -format _BLACKBOX_PID 32c -set _BLACKBOX_PID $$
session.screen0.rowPlacementDirection:	LeftToRight
session.screen0.showwindowposition:	true
session.screen0.slit.acceptKdeDockapps:	true
session.screen0.slit.alpha:	255
session.screen0.slit.autoHide:	true
session.screen0.slit.direction:	Vertical
session.screen0.slit.layer:	AboveDock
session.screen0.slit.maxOver:	false
session.screen0.slit.onhead:	0
session.screen0.slit.onTop:	False
session.screen0.slit.placement:	RightCenter
session.screen0.strftimeFormat:	%Y-%m-%d %H:%M
session.screen0.tabFocusModel:	SloppyTabFocus
session.screen0.tab.height:	16
session.screen0.tab.placement:	TopLeft
session.screen0.tabs.intitlebar:	true
session.screen0.tabs.maxOver:	true
session.screen0.tabs.usePixmap:	true
session.screen0.tab.width:	120
session.screen0.titlebar.left:	MenuIcon Stick Shade LHalf
session.screen0.titlebar.right:	RHalf Minimize Maximize Close
session.screen0.toolbar.alpha:	255
session.screen0.toolbar.autoHide:	false
session.screen0.toolbar.height:	0
session.screen0.toolbar.layer:	Dock
session.screen0.toolbar.maxOver:	false
session.screen0.toolbar.onhead:	0
session.screen0.toolbar.onTop:	False
session.screen0.toolbar.placement:	BottomCenter
session.screen0.toolbar.tools:	systemtray, workspacename, prevworkspace, nextworkspace, iconbar, prevwindow, nextwindow, clock
session.screen0.toolbar.visible:	true
session.screen0.toolbar.widthPercent:	100
session.screen0.tooltipDelay:	500
session.screen0.userFollowModel:	Follow
session.screen0.window.focus.alpha:	255
session.screen0.windowMenu:
session.screen0.windowPlacement:	RowSmartPlacement
session.screen0.windowScrollAction:
session.screen0.windowScrollReverse:	false
session.screen0.window.unfocus.alpha:	237
session.screen0.workspaceNames:	1,2,3,4,5,6,7,8,
session.screen0.workspaces:	8
session.screen0.workspacewarping:	true

 */

typedef struct {
	unsigned autoRaiseDelay;	/* 250 */
	unsigned cacheLife;		/* 5 */
	unsigned cacheMax;		/* 200 */
	unsigned colorsPerChannel;	/* 4 */
	unsigned doubleClickInterval;	/* 250 */
	Bool forcePseudoTransparency;	/* False */
	Bool ignoreBorder;		/* False */
	unsigned tabPadding;		/* 0 */
	FluxboxAttachArea tabsAttachArea;	/* Window */
	const char *appsFile;		/* ~/.fluxbox/apps */
	const char *groupFile;		/* ~/.fluxbox/groups */
	const char *keyFile;		/* ~/.fluxbox/keys */
	const char *menuFile;		/* ~/.fluxbox/menu */
	const char *slitlistFile;	/* ~/.fluxbox/slitlist */
	const char *styleFile;		/* */
	const char *styleOverlay;	/* ~/.fluxbox/overlay */

	unsigned modKey;		/* Mod1 *//* undocumented */
	Bool imageDither;		/* ?? *//* undocumented */
	const char *configVersion;	/* 13 *//* undocumented */
	Bool opaqueMove;		/* True *//* undocumented *//* screen resource? */
	FluxboxScreen *screens;
} FluxboxSession;

/*

session.appsFile:	~/.fluxbox/apps
session.autoRaiseDelay:	250
session.cacheLife:	5
session.cacheMax:	200
session.colorsPerChannel:	4
session.configVersion:	13
session.doubleClickInterval:	250
session.forcePseudoTransparency:	false
session.groupFile:	~/.fluxbox/groups
session.ignoreBorder:	false
session.imageDither:	True
session.keyFile:	~/.fluxbox/keys
session.menuFile:	~/.fluxbox/menu
session.modKey:	Mod1
session.opaqueMove:	False
session.slitlistFile:	~/.fluxbox/slitlist
session.styleFile:	/usr/share/fluxbox/styles/Penguins
session.styleOverlay:	~/.fluxbox/overlay
session.tabPadding:	0
session.tabsAttachArea:	Window

 */

typedef struct {
	char *rcfile;			/* rcfile */
	char *udir;			/* user directory */
	char *pdir;			/* private directory */
	char *sdir;			/* system directory */
} FluxboxConfig;

